brew "git"
brew "fnm"
brew "pnpm"
brew "pyenv"
cask "betterdisplay"
cask "ngrok"
cask "raycast"
cask "warp"
cask "cursor"
cask "insomnia"
cask "claude"
cask "notion"
cask "docker"
cask "slack"
cask "brave-browser"
cask "android-studio"
cask "datagrip"
cask "font-jetbrains-mono"
cask "font-zed-mono"
cask "obs"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "belfz.search-crates-io"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "coderabbit.coderabbit-vscode"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "fill-labs.dependi"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "hbenl.vscode-test-explorer"
vscode "hjdarnel.vscode-change-case"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "njpwerner.autodocstring"
vscode "orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-spanish"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wilfriedago.vscode-symbols-icon-theme"
vscode "wix.vscode-import-cost"